/*
엘리스 트랙 매칭
https://www.acmicpc.net/problem/31428

문제
엘리스 트랙은 2020년부터 시작한 KDT(K-Digital Training) 교육이며 Cloud 트랙, SW 엔지니어 트랙, IOT 트랙, AI 트랙 총 4가지 트랙이 있다.

누적 1000명 이상의 수료생을 배출하였고, 현업에서 활동하는 많은 수료생이 존재하는 엘리스 트랙을 신청할 시 성수/부산 엘리스랩을 이용할 수 있다. 또한, 현직 개발자의 멘토링을 직접 받을 수 있는 시간이 보장되며, 모든 트랙이 2개 이상의 실무와 비슷한 프로젝트를 수행 및 발표하여 피드백을 받을 수 있다. 그 외에 개발 블로그 챌린지, 스터디, 성수낙낙 오프라인 출석챌린지, 네트워킹 세션 등이 추가로 제공된다. 교육 수료 후 6개월간 취업 지원 프로그램이 제공되며, 대표적으로는 이력서 특강, 포트폴리오 특강, 직무 특강, 기술면접 특강 등이 진행된다.



헬로빗은 이러한 엘리스 트랙에 매력을 느껴 친구들 
$N$명을 모아 같이 엘리스 트랙에 지원하려 한다. 헬로빗의 친구들과 헬로빗이 지원하는 트랙에 대한 정보가 주어질 때, 헬로빗이 지원하는 트랙과 같은 트랙을 지원하는 헬로빗의 친구들은 총 몇 명이 있는지 출력하는 프로그램을 작성해 보자.

입력
첫 번째 줄에 친구들의 수를 의미하는 정수 
$N$이 주어진다. 
$(1 \leq N \leq 10 \, 000)$ 

두 번째 줄에 헬로빗의 친구들이 지원하는 엘리스 트랙에 대한 정보 
$N$개가 공백으로 구분되어 주어진다.

세 번째 줄에 헬로빗이 지원하는 엘리스 트랙에 대한 정보가 주어진다.

엘리스 트랙에 대한 정보는 Cloud 트랙은 'C', SW 엔지니어 트랙은 'S', IOT 트랙은 'I', AI 트랙은 'A'로 주어진다.

출력
헬로빗이 지원하는 트랙과 같은 트랙을 지원하는 헬로빗의 친구들은 총 몇 명이 있는지 출력한다.

예제 입력 1 
1
C
A
예제 출력 1 
0
예제 입력 2 
5
I A I S S
S
예제 출력 2 
2
*/

const fs = require("fs");
const [N, FRIENDS, ELICE] = fs
  .readFileSync("/dev/stdin")
  .toString()
  .trim()
  .split("\n");

const n = +N;
const freinds = FRIENDS.split(" ");

let count = 0;
freinds.forEach((e) => {
  if (e === ELICE) count++;
});

console.log(count);
