/*
단원평가
https://www.acmicpc.net/problem/31798

문제
재휘는 문제를 내기 위해 수학 문제를 둘러보다 간단한 퀴즈를 발견했다.



이 문제는 중학교 1학년 단원평가로 나온 문제로, 빈칸에 들어갈 답을 구하는 문제이다. 재휘는 답을 알고 싶어 하루 종일 고민했지만 결국 답을 구해내지 못하였다. 답을 고민하느라 너무 오랜 시간을 쓴 재휘는 DSPC에 출제하러 오지 못했다. 문제의 의도한 해답은 원 위의 두 수를 합하면 원 아래 수의 제곱이 된다는 것이다. 재휘가 출제를 할 수 있도록 문제를 풀어주는 프로그램을 작성해 보자.

입력
문제를 구성하는 수 
$a$, 
$b$, 
$c$가 한 줄에 공백으로 구분되어 주어진다.

하나의 원에서 
$a$는 왼쪽 위의 수, 
$b$는 오른쪽 위의 수, 
$c$는 아래 수를 나타낸다. 빈칸은 
$0$으로 주어진다.

예를 들어 그림의 제일 오른쪽 원의 경우 
$105$ 
$0$ 
$12$로 주어진다.

출력
빈칸에 들어갈 양의 정수를 출력한다. 답이 있는 입력만 주어진다.

제한
 
$0 \le a, b, c \le 10^4$ 
 
$a$, 
$b$, 
$c$ 중 한 개만 
$0$이고 나머지는 양의 정수이다.
예제 입력 1 
47 53 0
예제 출력 1 
10
예제 입력 2 
0 69 10
예제 출력 2 
31
예제 입력 3 
23 0 7
예제 출력 3 
26
*/

const fs = require("fs");
const [first, second, third] = fs
  .readFileSync("/dev/stdin")
  .toString()
  .trim()
  .split(" ")
  .map(Number);

if (third === 0) {
  console.log(Math.sqrt(first + second));
} else {
  console.log(third ** 2 - (first + second));
}
